#+TITLE: Config - Doom Emacs
#+AUTHOR: ch1ebak
#+PROPERTY: header-args :tangle config.el

* Fonts

#+BEGIN_SRC emacs-lisp

(setq doom-font (font-spec :family "mononoki Nerd Font" :size 12)
      doom-variable-pitch-font (font-spec :family "Cantarell" :size 12)
      doom-big-font (font-spec :family "mononoki Nerd Font" :size 20))
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
;; (def-package! highlight-indent-guides
  ;; :commands highlight-indent-guides-mode
  ;; :hook (prog-mode . highlight-indent-guides-mode)
  ;; :config
  ;; (setq highlight-indent-guides-method 'character
        ;; highlight-indent-guides-character ?/->
        ;; highlight-indent-guides-delay 0.01
        ;; highlight-indent-guides-responsive 'top
        ;; highlight-indent-guides-auto-enabled nil
        ;; ))

#+END_SRC

#+RESULTS:
| doom--customize-themes-h-8 | doom--customize-themes-h-9 |

